CV/cv.org
* Contact Information
** Vitali Liashchuk
   - Phone: +375296176863
   - Skype: vitali.liashchuk
   - Email: vitali.liashhuk@gmail.com

* Developer, Glera Games Jun 2019-Present
** Projects:
*** [[https://apps.apple.com/us/app/mahjong-treasure-quest/id1098189387][Mahjong Treasure Quest]]

**** Description: Puzzle
**** Used intensively: C++, cocos2d-x, Cocos Creator
**** Done:

	    * Implemented competition feature
	    * Implemented custom scroll table and tabs control Widgets.
	    * Active participation in development of new UI system based on in-house CSS parser.
	    * Implemented object transformations (transform/scale/rotate) for new UI system.

* Developer, Gambino 2015-2019
** Projects:
*** slototron.com
**** Description: Social Casino Game
**** Used intensively: C++, emscripten, javascript
**** Done:
            * Implemented payment system using paypal
            * Implemented requests retrying mechanism
            * Optimized game loading time by running network requests in parallel. 
            * Implemented prototype runnable on Instant Games Platform

*** [[https://apps.apple.com/us/app/gambino-slots-machine-casino/id1339105679][Gambino Slots]]
**** Description: Social Casino Game
**** Used intensively: C#, Xamarin, Dart Language
**** Done:
            * Reimplemented the Dart version of the game from scratch
            * Ported C# in-house game engine on MacOS
            * Integrated scissor OpenGl mechanism into the game
            * Integrated Firebase push messaging system 
            * Worked on converter C# to Dart (Based on Roslyn compiler)
            * Deep code refactoring. Splitting codebase for specific platforms.
            * Code base preparation to being translated.

* Developer, Synesis/MuGames 2015-2016 (1 year)
** Projects:
*** [[https://www.youtube.com/watch?v=2PBA6-wSNi0][WildRide]]
**** Description:
**** Used intensively: C#, Xamarin, Box2D
**** Done:
            * Implemented advertising manager with different AD providers support (vungle,chartboost,unity,etc)
            * Implemented social plugin system to support different social networks.
            * Implemented facebook social plugin (log-in, sharings, friends)
            * Implemented online contests system
            * Implemented anti-cheaters mechanism
            * Integrated a binary resources format
            * Implemented a continuous integration system  
 
*** [[https://www.youtube.com/watch?v=l7paSgeKoFU][Viber Rude Rider]]
**** Description: multi-platform 2D race and shoot game
**** Used intensively:* C#, Xamarin
**** Done:
            * Implemented Viber social plugin (log-in, sharings, friends)

* Developer, Gambino 2015-2015 (7 months)
** Projects:
*** [[https://apps.apple.com/us/app/gambino-slots-machine-casino/id1339105679][Gambino Slots]]
**** Description: Social Casino Game
**** Used intensively: C#, Xamarin, Dart Language\\
**** Done:
            * Implemented slots infrastructure with Dart Language
            * Implemented reels engine system
            * Implemented cheat system
            * Fixed loading issues on IE/Edge browsers 

* Developer, Playtika 2013-2015 (2 years 1 month)
** Projects:
*** [[https://apps.apple.com/us/app/caesars-casino-official-slots/id603097018][Caesars Casino]]
**** Description:* Social Casino Game
**** Used intensively: C#, Xamarin, Autofac, In-house game engine
**** Done:
            * Implemented a bunch of new slot and mini games
            * Implemented sound manager
            * Refactored reels engine
            * Implemented server requests stub system 
            * Helped to discover and fix a lot of bugs in game engine (render system, animation system, sound system)

* Developer, EPAM Systems Inc 2012-2013 (11 months)
** Projects:
*** Project Name: Under NDA
**** Description: Monitoring application for large distributed data storage systems.
**** Used intensively: python, javascript
**** Done:
            * Implemented a collecting system that aggregates metrics from data storages.  
            * Covered the data collecting system with unit tests.

* Free time.

     Playing with gamedev trending technologies such as Unreal Engine.\\
     Courses:
            https://www.udemy.com/unrealcourse/learn/v4/overview

     Reading professional literature:
           * Game Engine Architecture, Jason Gregory
           * Effective Modern C++, Skott Meyers
