CV/cv.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-18 Wed 21:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="VitaliLiashchuk" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9ba33c5">1. Contact Information</a>
<ul>
<li><a href="#org0790b83">1.1. Vitali Liashchuk</a></li>
</ul>
</li>
<li><a href="#org7923833">2. Developer, Glera Games Jun 2019-Present</a>
<ul>
<li><a href="#org13bf0db">2.1. Projects:</a>
<ul>
<li><a href="#orgc443085">2.1.1. Mahjong Treasure Quest</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org67a8bfa">3. Developer, Gambino 2015-2019</a>
<ul>
<li><a href="#org3112882">3.1. Projects:</a>
<ul>
<li><a href="#org0837259">3.1.1. slototron.com</a></li>
<li><a href="#org16417ad">3.1.2. Gambino Slots</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org91c27dc">4. Developer, Synesis/MuGames 2015-2016 (1 year)</a>
<ul>
<li><a href="#orgebdb5e0">4.1. Projects:</a>
<ul>
<li><a href="#orgbb75fad">4.1.1. WildRide</a></li>
<li><a href="#org2f9deda">4.1.2. Viber Rude Rider</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org92f93d6">5. Developer, Gambino 2015-2015 (7 months)</a>
<ul>
<li><a href="#org70a07f4">5.1. Projects:</a>
<ul>
<li><a href="#orgdf47330">5.1.1. Gambino Slots</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org25b6f1d">6. Developer, Playtika 2013-2015 (2 years 1 month)</a>
<ul>
<li><a href="#org3b352ec">6.1. Projects:</a>
<ul>
<li><a href="#org85d7817">6.1.1. Project Name: Caesars Casino</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgdf1d84a">7. Developer, EPAM Systems Inc 2012-2013 (11 months)</a>
<ul>
<li><a href="#org0bdcd94">7.1. Projects:</a>
<ul>
<li><a href="#org3e39fb7">7.1.1. Project Name: Under NDA</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga78fe45">8. Free time.</a></li>
</ul>
</div>
</div>
<div id="outline-container-org9ba33c5" class="outline-2">
<h2 id="org9ba33c5"><span class="section-number-2">1</span> Contact Information</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0790b83" class="outline-3">
<h3 id="org0790b83"><span class="section-number-3">1.1</span> Vitali Liashchuk</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Phone: +375296176863</li>
<li>Skype: vitali.liashchuk</li>
<li>Email: vitali.liashhuk@gmail.com</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7923833" class="outline-2">
<h2 id="org7923833"><span class="section-number-2">2</span> Developer, Glera Games Jun 2019-Present</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org13bf0db" class="outline-3">
<h3 id="org13bf0db"><span class="section-number-3">2.1</span> Projects:</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgc443085" class="outline-4">
<h4 id="orgc443085"><span class="section-number-4">2.1.1</span> Mahjong Treasure Quest</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
<b>Description:</b> Puzzle<br />
<b>Used intensively:</b> C++, cocos2d-x, Cocos Creator <br />
<b>Done:</b>
</p>
<ul class="org-ul">
<li>Implemented competition feature</li>
<li>Implemented custom scroll table and tabs control Widgets.</li>
<li>Active participation in development of new UI system based on in-house CSS parser.</li>
<li>Implemented object transformations (transform/scale/rotate) for new UI system.</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org67a8bfa" class="outline-2">
<h2 id="org67a8bfa"><span class="section-number-2">3</span> Developer, Gambino 2015-2019</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org3112882" class="outline-3">
<h3 id="org3112882"><span class="section-number-3">3.1</span> Projects:</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org0837259" class="outline-4">
<h4 id="org0837259"><span class="section-number-4">3.1.1</span> slototron.com</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
<b>Description:</b> Social Casino Game<br />
<b>Used intensively:</b> C++, emscripten, javascript<br />
<b>Done:</b>
</p>
<ul class="org-ul">
<li>Implemented payment system using paypal</li>
<li>Implemented requests retrying mechanism</li>
<li>Optimized game loading time by running network requests in parallel.</li>
<li>Implemented prototype runnable on Instant Games Platform</li>
</ul>
</div>
</div>

<div id="outline-container-org16417ad" class="outline-4">
<h4 id="org16417ad"><span class="section-number-4">3.1.2</span> Gambino Slots</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
<b>Description:</b> Social Casino Game<br />
<b>Used intensively:</b> C#, Xamarin, Dart Language<br />
<b>Done:</b>
</p>
<ul class="org-ul">
<li>Reimplemented the Dart version of the game from scratch</li>
<li>Ported C# in-house game engine on MacOS</li>
<li>Integrated scissor OpenGl mechanism into the game</li>
<li>Integrated Firebase push messaging system</li>
<li>Worked on converter C# to Dart (Based on Roslyn compiler)</li>
<li>Deep code refactoring. Splitting codebase for specific platforms.</li>
<li>Code base preparation to being translated.</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org91c27dc" class="outline-2">
<h2 id="org91c27dc"><span class="section-number-2">4</span> Developer, Synesis/MuGames 2015-2016 (1 year)</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgebdb5e0" class="outline-3">
<h3 id="orgebdb5e0"><span class="section-number-3">4.1</span> Projects:</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-orgbb75fad" class="outline-4">
<h4 id="orgbb75fad"><span class="section-number-4">4.1.1</span> WildRide</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
<b>Description:</b><br />
<b>Used intensively:</b> C#, Xamarin, Box2D<br />
<b>Done:</b>
</p>
<ul class="org-ul">
<li>Implemented advertising manager with different AD providers support (vungle,chartboost,unity,etc)</li>
<li>Implemented social plugin system to support different social networks.</li>
<li>Implemented facebook social plugin (log-in, sharings, friends)</li>
<li>Implemented online contests system</li>
<li>Implemented anti-cheaters mechanism</li>
<li>Integrated a binary resources format</li>
<li>Implemented a continuous integration system</li>
</ul>
</div>
</div>

<div id="outline-container-org2f9deda" class="outline-4">
<h4 id="org2f9deda"><span class="section-number-4">4.1.2</span> Viber Rude Rider</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
<b>Description:</b> multi-platform 2D race and shoot game<br />
<b>Used intensively:</b> C#, Xamarin<br />
<b>Done:</b>
</p>
<ul class="org-ul">
<li>Implemented Viber social plugin (log-in, sharings, friends)</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org92f93d6" class="outline-2">
<h2 id="org92f93d6"><span class="section-number-2">5</span> Developer, Gambino 2015-2015 (7 months)</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org70a07f4" class="outline-3">
<h3 id="org70a07f4"><span class="section-number-3">5.1</span> Projects:</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-orgdf47330" class="outline-4">
<h4 id="orgdf47330"><span class="section-number-4">5.1.1</span> Gambino Slots</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
<b>Description:</b> Social Casino Game<br />
<b>Used intensively:</b> C#, Xamarin, Dart Language<br />
<b>Done:</b>
</p>
<ul class="org-ul">
<li>Implemented slots infrastructure with Dart Language</li>
<li>Implemented reels engine system</li>
<li>Implemented cheat system</li>
<li>Fixed loading issues on IE/Edge browsers</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org25b6f1d" class="outline-2">
<h2 id="org25b6f1d"><span class="section-number-2">6</span> Developer, Playtika 2013-2015 (2 years 1 month)</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org3b352ec" class="outline-3">
<h3 id="org3b352ec"><span class="section-number-3">6.1</span> Projects:</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org85d7817" class="outline-4">
<h4 id="org85d7817"><span class="section-number-4">6.1.1</span> Project Name: Caesars Casino</h4>
<div class="outline-text-4" id="text-6-1-1">
<p>
<b>Description:</b> Social Casino Game<br />
<b>Used intensively:</b> C#, Xamarin, Autofac, In-house game engine<br />
<b>Done:</b>
</p>
<ul class="org-ul">
<li>Implemented a bunch of new slot and mini games</li>
<li>Implemented sound manager</li>
<li>Refactored reels engine</li>
<li>Implemented server requests stub system</li>
<li>Helped to discover and fix a lot of bugs in game engine (render system, animation system, sound system)</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdf1d84a" class="outline-2">
<h2 id="orgdf1d84a"><span class="section-number-2">7</span> Developer, EPAM Systems Inc 2012-2013 (11 months)</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org0bdcd94" class="outline-3">
<h3 id="org0bdcd94"><span class="section-number-3">7.1</span> Projects:</h3>
<div class="outline-text-3" id="text-7-1">
</div>
<div id="outline-container-org3e39fb7" class="outline-4">
<h4 id="org3e39fb7"><span class="section-number-4">7.1.1</span> Project Name: Under NDA</h4>
<div class="outline-text-4" id="text-7-1-1">
<p>
<b>Description:</b> Monitoring application for large distributed data storage systems.<br />
<b>Used intensively:</b> python, javascript<br />
<b>Done:</b>
</p>
<ul class="org-ul">
<li>Implemented a collecting system that aggregates metrics from data storages.</li>
<li>Covered the data collecting system with unit tests.</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orga78fe45" class="outline-2">
<h2 id="orga78fe45"><span class="section-number-2">8</span> Free time.</h2>
<div class="outline-text-2" id="text-8">
<p>
Playing with gamedev trending technologies such as Unreal Engine.<br />
Courses:
       <a href="https://www.udemy.com/unrealcourse/learn/v4/overview">https://www.udemy.com/unrealcourse/learn/v4/overview</a>
</p>

<p>
Reading professional literature:
</p>
<ul class="org-ul">
<li>Game Engine Architecture, Jason Gregory</li>
<li>Effective Modern C++, Skott Meyers</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: VitaliLiashchuk</p>
<p class="date">Created: 2019-12-18 Wed 21:00</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
